app/Http/Controllers/Api/V1/Front/Contact/ContactController.php

    public function sendMessage(ContactRequest $request)
    {
        $data = $request->validated();
        $message = Message::create($data);

        $admins = Admin::all();
---
insert into `messages` (`name`, `email`, `subject`, `content`, `updated_at`, `created_at`) values ('youssef', 'youssefreda@email.com', 'hello Admin', 'hello deveolper', '2024-12-06 15:23:54', '2024-12-06 15:23:54')
select * from `admins`