app/Http/Controllers/front/AppointmentController.php

    public function index()
    {
        $patients = Appointment::where('patient_id', auth()->user()->id)->get();
---
select * from `appointments` where `patient_id` = 58

    public function store(Doctor $doctor, Request $request)
    {
        $request->validate([
            'name' => 'required|string|max:30',
            'email' => 'required|string|email',
            'phone' => 'required|numeric'
        ]);

        $data = Appointment::create([
            'name' => $request->name,
            'email' => $request->email,
            'phone' => $request->phone,
            'appointment_date' => date('Y-m-d H:i:s'),
            'patient_id' => auth()->user()->id,
            'doctor_id' => $doctor->id
        ]);

        $admins = Admin::all();
---
insert into `appointments` (`name`, `email`, `phone`, `appointment_date`, `patient_id`, `doctor_id`, `updated_at`, `created_at`) values ('Oleg Howe', 'dowehow@mailinator.com', '01200000000', '2024-12-05 16:32:48', 24, 7, '2024-12-05 16:32:48', '2024-12-05 16:32:48')
select * from `admins`