app/Http/Controllers/front/ContactController.php

insert into `messages` (`name`, `email`, `subject`, `content`, `updated_at`, `created_at`) values ('Kelsey Tran', 'qyfalihiw@mailinator.com', 'Dolores rem magna pr', 'Veritatis est est at', '2024-12-05 15:33:28', '2024-12-05 15:33:28')
select * from `admins` limit 1
---
    public function sendMessage(Request $request)
    {
        //validation
        $request->validate(
            [
                "name" => ["required", "string", "min:3", "max:30"],
                "email" => ["required", "email"],
                "subject" => ["required", "string", "min:5", "max:50"],
                "content" => ["required", "min:10", "max:500"]
            ]
        );

        //connect to database
        $message = new Message();

        $message->name = $request->name;
        $message->email = $request->email;
        $message->subject = $request->subject;
        $message->content = $request->content;
        $message->save();

        $admins = Admin::all();