app/Http/Controllers/front/DoctorController.php

    public function index()
    {
        $doctors = User::with('major')->where('role','doctor')->paginate(12);
---
select * from `majors` where `majors`.`id` in (3, 9, 12, 14, 16, 23, 29, 32, 37, 41, 46)
select * from `users` where `role` = 'doctor' limit 12 offset 0
select count(*) as aggregate from `users` where `role` = 'doctor'