app/Http/Controllers/front/HomeController.php

select * from `majors` limit 4
select * from `users` limit 4
---
    public function index()
    {
        //->take(4)->get()
        $majors = Major::limit(4)->get();
        $doctors = User::limit(4)->get();