app/Http/Controllers/front/HomeController.php

select * from `majors` where `majors`.`id` in (52, 87, 93, 97)
select * from `users` where `role` = 'doctor' limit 4
---
    public function index()
    {
        //->take(4)->get()
        $majors = Major::limit(4)->get();
        $doctors = User::with('major')->where('role', 'doctor')->limit(4)->get();