app/Http/Controllers/front/MajorController.php

select * from `majors` order by `id` desc limit 12 offset 0
select count(*) as aggregate from `majors`
---
    public function index()
    {
        //paginate
        //simplePaginate
        //cursorPaginate
        $majors = Major::orderBy("id", "DESC")->paginate(12);

select count(*) as aggregate from `doctors` where `major_id` = 42
---
    public function doctors(Major $major)
    {
        $doctors = Doctor::with('major')
            ->where('major_id', $major->id)
            ->paginate(12);