app/Http/Controllers/Admin/User/UserController.php

    public function index()
    {
        $users = User::orderBy('id', 'DESC')->paginate(12);
---
select * from `users` order by `id` desc limit 12 offset 0
select count(*) as aggregate from `users`

    public function search(Request $request)
    {
        $users = User::where('name', 'like', "%$request->search%")
            ->paginate(5);
---
select * from `users` where `name` like '%Soledad Carroll%' limit 5 offset 0
select count(*) as aggregate from `users` where `name` like '%Soledad Carroll%'