app/Http/Controllers/Api/V1/Front/Major/MajorController.php

    public function index()
    {
        $majors = Major::paginate(12);
---
select * from `majors` limit 12 offset 0
select count(*) as aggregate from `majors`