app/Http/Controllers/Admin/Report/ReportController.php

select * from `doctors` where `doctors`.`id` in (34)
select * from `reports` limit 12 offset 0
select * from `users` where `users`.`id` in (20)
select count(*) as aggregate from `reports`
---
    public function index()
    {
        $reports = Report::with('user')
            ->with('doctor')
            ->paginate(12);

select count(*) as aggregate from `reports` where `patient_id` like '%197%'
---
    public function search(Request $request)
    {
        $reports = Report::where('patient_id', 'like', "%$request->search%")
            ->with('user')
            ->with('doctor')
            ->paginate(5);

delete from `reports` where `id` = 3
---
    public function destroy(Report $report)
    {
        $report->delete();