app/Http/Controllers/CustomAuth/AuthController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Wendy Petty', 'wuzukige@mailinator.com', '$2y$12$Di.xah56hR4HUm/k7snZS.LeEYrdFl9gcdE7HvPSO3yS5pz4Z4jQi', '2024-12-03 21:13:46', '2024-12-03 21:13:46')
---
    public function store(Request $requst){
        $data = $requst -> validate([
            "name" =>['required','string','max:30','min:5'],
            'email' => ['required','string','email','unique:users'],
            'password' => ['required','string','min:8','confirmed'] // or  confirm:password(confirmation-password)
        ]);

        $user = User::create($data);