app/Http/Controllers/Admin/Admin/AdminController.php

select * from `admins` order by `id` desc limit 12 offset 0
select count(*) as aggregate from `admins`
---
    public function index()
    {
        $admins = Admin::orderBy('id', 'DESC')->paginate(12);

delete from `admins` where `id` = 7
---
    public function destroy(Admin $admin)
    {
        $this->delete('uploads/admins/', $admin->image);
        $admin->delete();