app/Http/Controllers/Api/V1/AuthController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('youssef', 'youssef@gmail.com', '$2y$12$UOCuCTNPuqhkwunBJny/kubqMJFh/4DYZQ3VCz72N7ybO5iVDkbM6', '2024-12-03 23:14:03', '2024-12-03 23:14:03')
---
    public function register(RegisterRequest $request)
    {
        $data = $request->validated();
        $user = User::create($data);
        $token = $user->createToken('auth.register')->plainTextToken;