app/Http/Controllers/Api/V1/MajorController.php

select * from `majors`
select * from `users` where `users`.`major_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50)
---
    public function index()
    {
        $majors = Major::with('users')->get();

select * from `majors` where `majors`.`id` = '1' limit 1
---
    public function show($id)
    {
        $major = Major::findOrFail($id);

select * from `users` where `role` = 'doctor' and `major_id` = '2'
---
    public function doctors($id)
    {
        $doctors = User::where('role', 'doctor')
            ->where('major_id', $id)
            ->get();