app/Http/Controllers/Doctor/DoctorController.php

select * from `appointments` where `doctor_id` = 2 limit 12 offset 0
select count(*) as aggregate from `appointments` where `doctor_id` = 2
select count(*) as aggregate from `appointments` where `doctor_id` = 34
---
   public function index()
   {
      $doctor = auth()->guard('doctor')->user();
      $appointments = Appointment::where('doctor_id', $doctor->id)->paginate(12);
      $appointmentsCount = Appointment::where('doctor_id', $doctor->id)->count();