app/Http/Controllers/Api/V1/Front/Home/HomeController.php

select * from `majors` limit 5
select * from `doctors` limit 5
select * from `majors` where `majors`.`id` in (20, 24, 28, 40, 48)
---
    public function index()
    {
        $majors = Major::limit(5)->get();
        $doctors = Doctor::with('major')->limit(5)->get();