app/Http/Controllers/Admin/Message/MessageController.php

    public function index()
    {
        $messages = Message::paginate(12);
---
select * from `messages` limit 12 offset 0
select count(*) as aggregate from `messages`