app/Http/Controllers/Admin/Appointment/AppointmentController.php

    public function index()
    {
        $appointments = Appointment::with('doctor')
            ->with('user')
            ->paginate(12);
---
select * from `doctors` where `doctors`.`id` in (2, 7)
select * from `users` where `users`.`id` in (8, 20, 24, 25)
select * from `appointments` limit 12 offset 0
select count(*) as aggregate from `appointments`

    public function search(Request $request)
    {
        $appointments = Appointment::where('name', 'like', "%$request->search%")
            ->with('doctor')
            ->with('user')
            ->paginate(5);
---
select count(*) as aggregate from `appointments` where `name` like '%dfsf%'