app/Http/Controllers/Admin/Doctor/DoctorController.php

    public function index()
    {
        $doctors = Doctor::orderBy("id", "DESC")->with('major')->paginate(12);
---
select * from `doctors` order by `id` desc limit 12 offset 0
select * from `majors` where `majors`.`id` in (3, 6, 19, 22, 30, 36, 38, 40, 44, 48, 49)
select count(*) as aggregate from `doctors`

    public function create()
    {
        $majors = Major::all();
---
select * from `majors`

    public function edit(Doctor $doctor)
    {
        $majors = Major::all();
---
select * from `majors`

    public function search(Request $request)
    {
        $doctors = Doctor::where('name', 'like', "%$request->search%")
            ->with('major')
            ->paginate(5);
---
select * from `doctors` where `name` like '%c%' limit 5 offset 0
select * from `majors` where `majors`.`id` in (19, 20, 24, 39, 40)
select count(*) as aggregate from `doctors` where `name` like '%372%'

    public function destroy(Doctor $doctor)
    {
        $this->delete('uploads/doctors/', $doctor->image);
---
delete from `doctors` where `id` = 31