app/Http/Controllers/Api/V1/Front/Appointment/AppointmentController.php

    public function store(Doctor $doctor, AppointmentRequest $request)
    {
        $data = Appointment::create([
            'name' => $request->name,
            'email' => $request->email,
            'phone' => $request->phone,
            'appointment_date' => date('Y-m-d H:i:s'),
            'patient_id' => auth()->id(),
            'doctor_id' => $doctor->id
        ]);

        $admins = Admin::all();
---
insert into `appointments` (`name`, `email`, `phone`, `appointment_date`, `patient_id`, `doctor_id`, `updated_at`, `created_at`) values ('mohamed', 'mohamed@gmail.com', '012000000', '2024-12-09 11:50:13', 20, 2, '2024-12-09 11:50:13', '2024-12-09 11:50:13')
select * from `admins`