app/Http/Controllers/Admin/Major/MajorController.php

    public function index()
    {
        $majors = Major::orderBy("id", "DESC")->paginate(12);
---
select * from `majors` order by `id` desc limit 12 offset 0
select count(*) as aggregate from `majors`