app/Http/Controllers/Admin/AdminHomeController.php

    public function index()
    {

        $users = User::count();
        $admins = Admin::count();
        $doctors = Doctor::count();
        $majors = Major::count();
        $appiontments = Appointment::count();
        $reports = Report::count();
        $messagesCount = Message::count();
        $messages = Message::orderBy('id', 'DESC')->take(5)->get();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `admins`
select count(*) as aggregate from `doctors`
select count(*) as aggregate from `majors`
select count(*) as aggregate from `appointments`
select count(*) as aggregate from `reports`
select count(*) as aggregate from `messages`
select * from `messages` order by `id` desc limit 5