app/Http/Controllers/Admin/MajorController.php

    public function index()
    {
        $majors = Major::orderBy("id", "DESC")->paginate(12);
---
select * from `majors` order by `id` desc limit 12 offset 0
select count(*) as aggregate from `majors`

    public function store(MajorRequest $request)
    {

        //use valedation  make:request
        //vaidation
        // request()->validate(
        //     [
        //         //another direction use pipeline => |
        //         "name" => "required|string|min:3|max:30",
        //         "image" => "required|image"
        //     ]
        // );

        // $image_name = request()->image->getClientOriginalName();
        // // $image_ext = request()->image->getClientOriginalExtension(); //or extension();
        // $image_name = time() . rand(1, 100000) . '_' . $image_name;
        // request()->image->move(public_path('uploads/majors/'), $image_name);

        $image_name = $this->upload('uploads/majors/');
        $data = $request->validated();
        $data['image'] = $image_name;
        //stote data anther diriction
        Major::create($data);
---
insert into `majors` (`name`, `image`, `updated_at`, `created_at`) values ('laravel', '173180370875396_laravel.svg', '2024-11-17 00:35:08', '2024-11-17 00:35:08')